#Задание 1
# a = int(input("Введите первое число "))
# b = int(input("Введите второе число "))
# c = int(input("Введите третье число "))
# print(f"{a}{b}{c}")

#Задание 2
# a = int(input("Введите 1 число "))
# b = int(input("Введите 2 число "))
# c = int(input("Введите 3 число "))
# d = int(input("Введите 4 число "))
# print(a * b * c * d)

#Задание 3
# a = int(input("Введите длину в метрах\n"))
# b = int(input("Выберите действие: 1 перевести в мили , 2 перевести в сантиметры , 3 перевести в дециметры , "
#               "4 перевести в миллиметры "))
# if b == 1:
#     print(f"В милях:", a / 1609)
# if b == 2:
#     print(f"В сантиметрах:", a * 100)
# if b == 3:
#     print(f"В дециметрах:", a * 10)
# if b == 4:
#     print(f"В миллиметрах:", a * 1000)

# Задание 4

# a = int(input("Введите основание треугольника для расчета площади "))
# b = int(input("Введите высоту треугольника "))
# s = 0.5 * a * b
# print("Площадь треугольника равна :", s)


# Задание 5
number = (input("Введите четырехзначное число "))
number = number[::-1]
print(number)